// 方法函数与指标项数据填报内容的dialog控制展示器，通过js文件中存储的方法code与value值得对应关系，页面dialog控制对应指标数据填写内容展示
// 不同的方法定义编写不同的dialog表单内容
// js页面引用方法：import funCodeList from '@/pages/funCodeList.js'
// 页面js使用funCodeList：funCodeList.forEach(item=>{ if (item.code == funCode) {flag = item.value} })

// ===================================苏州河流指标开始===============================
const APZB = 1 //岸坡植被覆盖度
const HLLDX = 2 //河流流动性
const STYSMZCD = 3 //生态用水满足程度
const SZYLCD = 4 //水质优劣程度
const JGSSCD = 5 //景观舒适程度
const RHPWK = 6 //入河排污口规范化建设
const AXKFLYL = 7//岸线开发利用率
const SGNQ = 8 //水功能区
// ====================================苏州河流指标结束==================================

// ====================================苏州湖泊指标开始==================================

const HBDZBFGD = 9 //湖滨带植被覆盖度
const RHHSSZ = 10 //入湖河水水质 
const HPSGNQ = 11 // 水功能区
const HPAXKFLYL = 12 //岸线开发利用率
// ====================================苏州湖泊指标结束==================================

const funCodeList = [
    // ===================================苏州河流指标开始===============================
    {
        code: 'sz_he_2',
        value: APZB
    },
    {
        code: 'sz_he_3',
        value: HLLDX
    },
    {
        code: 'sz_he_4_1',
        value: STYSMZCD
    },
    {
        code: 'sz_he_4_2',
        value: STYSMZCD
    },
    {
        code: 'sz_he_5',
        value: SZYLCD
    },
    {
        code: 'sz_he_14',
        value: JGSSCD
    },
    {
        code: 'sz_he_17',
        value: RHPWK
    },
    {
        code: 'sz_he_16',
        value: AXKFLYL
    },
    {
        code: 'sz_he_11',
        value: SGNQ
    },
    // ====================================苏州河流指标结束==================================

    // ====================================浙江河流指标开始==================================
    {
        code: 'zj_river_12',
        value: SGNQ
    },
    // ====================================浙江河流指标结束==================================
    
    // ====================================江苏河流指标开始==================================
    {
        code: 'js_river_4',
        value: SGNQ
    },
    {
        code: 'js_river_9',
        value: APZB
    },
    // ====================================江苏河流指标结束==================================

    // ====================================苏州湖泊指标开始==================================
    {
        code: 'sz_lake_2',
        value: HBDZBFGD
    },
    {
        code: 'sz_lake_8',
        value: RHHSSZ
    },
    {
        code: 'sz_lake_12',
        value: HPSGNQ
    },
    {
        code: 'sz_lake_16',
        value: HPAXKFLYL
    },
    // ====================================苏州湖泊指标结束==================================

    // ====================================江苏湖泊指标开始==================================
    {
        code: 'js_lake_3',
        value: HPSGNQ
    },
    // ====================================江苏湖泊指标结束==================================
   
]

export default funCodeList